diy_data_harvester/ndw_harvester/data/gebeurtenisinfo.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/"><SOAP:Body><d2LogicalModel xmlns="http://datex2.eu/schema/2/2_0" modelBaseVersion="2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><exchange><supplierIdentification><country>nl</country><nationalIdentifier>NLNDW</nationalIdentifier></supplierIdentification><subscription><operatingMode>operatingMode3</operatingMode><subscriptionStartTime>2021-10-20T11:04:23.426Z</subscriptionStartTime><subscriptionState>active</subscriptionState><updateMethod>snapshot</updateMethod><target><address/><protocol>HTTP</protocol></target></subscription></exchange><payloadPublication xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="SituationPublication" lang="nl"><publicationTime>2021-11-18T09:53:28.470Z</publicationTime><publicationCreator><country>nl</country><nationalIdentifier>NLNDW</nationalIdentifier></publicationCreator><situation id="NLRWS_0002906446" version="1"><overallSeverity>lowest</overallSeverity><situationVersionTime>2021-11-18T09:17:45.792417Z</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="RoadOrCarriagewayOrLaneManagement" id="NLRWS_0002906446_1" version="1"><situationRecordCreationTime>2021-11-18T09:17:45.792417Z</situationRecordCreationTime><situationRecordVersionTime>2021-11-18T09:17:45.792417Z</situationRecordVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceName><values><value lang="nl">NLRWS</value></values></sourceName></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2021-11-18T09:17:45.792417Z</overallStartTime><validPeriod><startOfPeriod>2021-11-18T09:17:45.792417Z</startOfPeriod></validPeriod></validityTimeSpecification></validity><cause xsi:type="NonManagedCause"><causeDescription><values><value lang="nl">Spoedreparatie</value></values></causeDescription><causeType>other</causeType></cause><groupOfLocations xsi:type="Linear"><locationForDisplay><latitude>52.206505</latitude><longitude>4.4913282</longitude></locationForDisplay><supplementaryPositionalDescription><affectedCarriagewayAndLanes><carriageway>entrySlipRoad</carriageway></affectedCarriagewayAndLanes></supplementaryPositionalDescription><alertCLinear xsi:type="AlertCMethod4Linear"><alertCLocationCountryCode>8</alertCLocationCountryCode><alertCLocationTableNumber>6.4</alertCLocationTableNumber><alertCLocationTableVersion>A</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>negative</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><specificLocation>9294</specificLocation></alertCLocation><offsetDistance><offsetDistance>0</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation><alertCMethod4SecondaryPointLocation><alertCLocation><specificLocation>9280</specificLocation></alertCLocation><offsetDistance><offsetDistance>12300</offsetDistance></offsetDistance></alertCMethod4SecondaryPointLocation></alertCLinear><linearExtension><linearByCoordinatesExtension><linearCoordinatesStartPoint><pointCoordinates><latitude>52.206505</latitude><longitude>4.4913282</longitude></pointCoordinates></linearCoordinatesStartPoint><linearCoordinatesEndPoint><pointCoordinates><latitude>52.206505</latitude><longitude>4.4913282</longitude></pointCoordinates></linearCoordinatesEndPoint></linearByCoordinatesExtension></linearExtension></groupOfLocations><operatorActionStatus>implemented</operatorActionStatus><complianceOption>mandatory</complianceOption><roadOrCarriagewayOrLaneManagementType>carriagewayClosures</roadOrCarriagewayOrLaneManagementType></situationRecord></situation><situation id="NLRWS_0002906445" version="2"><overallSeverity>lowest</overallSeverity><situationVersionTime>2021-11-18T09:19:56.026526Z</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="RoadOrCarriagewayOrLaneManagement" id="NLRWS_0002906445_1" version="2"><situationRecordCreationTime>2021-11-18T09:17:14.617942Z</situationRecordCreationTime><situationRecordVersionTime>2021-11-18T09:19:56.026526Z</situationRecordVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceName><values><value lang="nl">NLRWS</value></values></sourceName></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2021-11-18T09:17:14.617942Z</overallStartTime><validPeriod><startOfPeriod>2021-11-18T09:17:14.617942Z</startOfPeriod></validPeriod></validityTimeSpecification></validity><cause xsi:type="NonManagedCause"><causeDescription><values><value lang="nl">Spoedreparatie</value></values></causeDescription><causeType>other</causeType></cause><generalPublicComment><comment><values><value lang="nl">Verkeer kan keren bij afrit Oegstgeest (7).</value></values></comment></generalPublicComment><groupOfLocations xsi:type="Linear"><locationForDisplay><latitude>52.20173</latitude><longitude>4.4789586</longitude></locationForDisplay><supplementaryPositionalDescription><affectedCarriagewayAndLanes><carriageway>exitSlipRoad</carriageway></affectedCarriagewayAndLanes></supplementaryPositionalDescription><alertCLinear xsi:type="AlertCMethod4Linear"><alertCLocationCountryCode>8</alertCLocationCountryCode><alertCLocationTableNumber>6.4</alertCLocationTableNumber><alertCLocationTableVersion>A</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>negative</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><specificLocation>9293</specificLocation></alertCLocation><offsetDistance><offsetDistance>0</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation><alertCMethod4SecondaryPointLocation><alertCLocation><specificLocation>9280</specificLocation></alertCLocation><offsetDistance><offsetDistance>13300</offsetDistance></offsetDistance></alertCMethod4SecondaryPointLocation></alertCLinear><linearExtension><linearByCoordinatesExtension><linearCoordinatesStartPoint><pointCoordinates><latitude>52.20173</latitude><longitude>4.4789586</longitude></pointCoordinates></linearCoordinatesStartPoint><linearCoordinatesEndPoint><pointCoordinates><latitude>52.20173</latitude><longitude>4.4789586</longitude></pointCoordinates></linearCoordinatesEndPoint></linearByCoordinatesExtension></linearExtension></groupOfLocations><operatorActionStatus>implemented</operatorActionStatus><complianceOption>mandatory</complianceOption><roadOrCarriagewayOrLaneManagementType>carriagewayClosures</roadOrCarriagewayOrLaneManagementType></situationRecord></situation><situation id="RWS02_0000361468" version="3"><overallSeverity>medium</overallSeverity><relatedSituation id="RWS03_131193" version="last" targetClass="Situation"/><situationVersionTime>2021-11-18T09:31:10Z</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="VehicleObstruction" id="RWS02_0000361468_361468" version="3"><situationRecordCreationTime>2021-11-18T09:29:09Z</situationRecordCreationTime><situationRecordVersionTime>2021-11-18T09:31:10Z</situationRecordVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceName><values><value lang="nl">Rijkswaterstaat</value></values></sourceName></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2021-11-18T09:29:09Z</overallStartTime></validityTimeSpecification></validity><generalPublicComment><comment><values><value>RWS Weginspecteur</value></values></comment></generalPublicComment><groupOfLocations xsi:type="Point"><locationForDisplay><latitude>51.39361</latitude><longitude>6.120382</longitude></locationForDisplay><supplementaryPositionalDescription><affectedCarriagewayAndLanes><carriageway>parallelCarriageway</carriageway></affectedCarriagewayAndLanes></supplementaryPositionalDescription><alertCPoint xsi:type="AlertCMethod4Point"><alertCLocationCountryCode>8</alertCLocationCountryCode><alertCLocationTableNumber>6.4</alertCLocationTableNumber><alertCLocationTableVersion>A</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>negative</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><specificLocation>10056</specificLocation></alertCLocation><offsetDistance><offsetDistance>400</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation></alertCPoint><pointByCoordinates><pointCoordinates><latitude>51.39361</latitude><longitude>6.120382</longitude></pointCoordinates></pointByCoordinates></groupOfLocations><situationRecordExtension><situationRecordExtendedApproved><safetyRelatedMessage>true</safetyRelatedMessage></situationRecordExtendedApproved></situationRecordExtension><mobilityOfObstruction><mobilityType>stationary</mobilityType></mobilityOfObstruction><vehicleObstructionType>emergencyVehicle</vehicleObstructionType><obstructingVehicle><vehicleCharacteristics><vehicleUsage>roadOperator</vehicleUsage></vehicleCharacteristics></obstructingVehicle></situationRecord></situation><situation id="RWS02_0000361471" version="6"><overallSeverity>medium</overallSeverity><situationVersionTime>2021-11-18T09:53:12Z</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="VehicleObstruction" id="RWS02_0000361471_361471" version="6"><situationRecordCreationTime>2021-11-18T09:36:09Z</situationRecordCreationTime><situationRecordVersionTime>2021-11-18T09:53:12Z</situationRecordVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceName><values><value lang="nl">Rijkswaterstaat</value></values></sourceName></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2021-11-18T09:36:09Z</overallStartTime></validityTimeSpecification></validity><generalPublicComment><comment><values><value>RWS Weginspecteur</value></values></comment></generalPublicComment><groupOfLocations xsi:type="Linear"><locationForDisplay><latitude>51.53866</latitude><longitude>4.79665</longitude></locationForDisplay><supplementaryPositionalDescription><affectedCarriagewayAndLanes><carriageway>mainCarriageway</carriageway></affectedCarriagewayAndLanes></supplementaryPositionalDescription><alertCLinear xsi:type="AlertCMethod4Linear"><alertCLocationCountryCode>8</alertCLocationCountryCode><alertCLocationTableNumber>6.4</alertCLocationTableNumber><alertCLocationTableVersion>A</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>positive</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><specificLocation>21504</specificLocation></alertCLocation><offsetDistance><offsetDistance>0</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation><alertCMethod4SecondaryPointLocation><alertCLocation><specificLocation>21504</specificLocation></alertCLocation><offsetDistance><offsetDistance>0</offsetDistance></offsetDistance></alertCMethod4SecondaryPointLocation></alertCLinear><linearExtension><linearByCoordinatesExtension><linearCoordinatesStartPoint><pointCoordinates><latitude>51.5364075</latitude><longitude>4.801186</longitude></pointCoordinates></linearCoordinatesStartPoint><linearCoordinatesEndPoint><pointCoordinates><latitude>51.53868</latitude><longitude>4.796721</longitude></pointCoordinates></linearCoordinatesEndPoint></linearByCoordinatesExtension></linearExtension></groupOfLocations><situationRecordExtension><situationRecordExtendedApproved><safetyRelatedMessage>true</safetyRelatedMessage></situationRecordExtendedApproved></situationRecordExtension><mobilityOfObstruction><mobilityType>mobile</mobilityType></mobilityOfObstruction><vehicleObstructionType>emergencyVehicle</vehicleObstructionType><obstructingVehicle><vehicleCharacteristics><vehicleUsage>roadOperator</vehicleUsage></vehicleCharacteristics></obstructingVehicle></situationRecord></situation></payloadPublication></d2LogicalModel></SOAP:Body></SOAP:Envelope>